/************************************************************************************************/
/*                                                                                              */
/*  Copyright 2010  Broadcom Corporation                                                        */
/*                                                                                              */
/*     Unless you and Broadcom execute a separate written software license agreement governing  */
/*     use of this software, this software is licensed to you under the terms of the GNU        */
/*     General Public License version 2 (the GPL), available at                                 */
/*                                                                                              */
/*          http://www.broadcom.com/licenses/GPLv2.php                                          */
/*                                                                                              */
/*     with the following added to such license:                                                */
/*                                                                                              */
/*     As a special exception, the copyright holders of this software give you permission to    */
/*     link this software with independent modules, and to copy and distribute the resulting    */
/*     executable under terms of your choice, provided that you also meet, for each linked      */

#define    RFBB_TX2G_TPR6_2_TPR0_SHIFT                                    0
#define    RFBB_TX2G_TPR6_2_TPR0_MASK                                     0x000003FF

#define RFBB_TX2G_TPR6_3_OFFSET                                           0x0000018C
#define RFBB_TX2G_TPR6_3_TYPE                                             UInt32
#define RFBB_TX2G_TPR6_3_RESERVED_MASK                                    0xFC00FC00
#define    RFBB_TX2G_TPR6_3_TPR1_SHIFT                                    16
#define    RFBB_TX2G_TPR6_3_TPR1_MASK                                     0x03FF0000
#define    RFBB_TX2G_TPR6_3_TPR0_SHIFT                                    0
#define    RFBB_TX2G_TPR6_3_TPR0_MASK                                     0x000003FF

#define RFBB_TX2G_TPR6_4_OFFSET                                           0x00000190
#define RFBB_TX2G_TPR6_4_TYPE                                             UInt32
#define RFBB_TX2G_TPR6_4_RESERVED_MASK                                    0xFC00FC00
#define    RFBB_TX2G_TPR6_4_TPR1_SHIFT                                    16
#define    RFBB_TX2G_TPR6_4_TPR1_MASK                                     0x03FF0000
#define    RFBB_TX2G_TPR6_4_TPR0_SHIFT                                    0
#define    RFBB_TX2G_TPR6_4_TPR0_MASK                                     0x000003FF

#define RFBB_TX2G_TPR6_5_OFFSET                                           0x00000194
#define RFBB_TX2G_TPR6_5_TYPE                                             UInt32
#define RFBB_TX2G_TPR6_5_RESERVED_MASK                                    0xFC00FC00
#define    RFBB_TX2G_TPR6_5_TPR1_SHIFT                                    16
#define    RFBB_TX2G_TPR6_5_TPR1_MASK                                     0x03FF0000
#define    RFBB_TX2G_TPR6_5_TPR0_SHIFT                                    0
#define    RFBB_TX2G_TPR6_5_TPR0_MASK                                     0x000003FF

#define RFBB_TX2G_TPR6_6_OFFSET                                           0x00000198
#define RFBB_TX2G_TPR6_6_TYPE                                             UInt32
#define RFBB_TX2G_TPR6_6_RESERVED_MASK                                    0xFC00FC00
#define    RFBB_TX2G_TPR6_6_TPR1_SHIFT                                    16
#define    RFBB_TX2G_TPR6_6_TPR1_MASK                                     0x03FF0000
#define    RFBB_TX2G_TPR6_6_TPR0_SHIFT                                    0
#define    RFBB_TX2G_TPR6_6_TPR0_MASK                                     0x000003FF

#define RFBB_TX2G_TPR6_7_OFFSET                                           0x0000019C
#define RFBB_TX2G_TPR6_7_TYPE                                             UInt32
#define RFBB_TX2G_TPR6_7_RESERVED_MASK                                    0xFC00FC00
#define    RFBB_TX2G_TPR6_7_TPR1_SHIFT                                    16
#define    RFBB_TX2G_TPR6_7_TPR1_MASK                                     0x03FF0000
#define    RFBB_TX2G_TPR6_7_TPR0_SHIFT                                    0
#define    RFBB_TX2G_TPR6_7_TPR0_MASK                                     0x000003FF

typedef volatile struct {
   UInt32 m_MODADR;                  // 0x0000
   UInt32 m_MODDAT;                  // 0x0004
   UInt32 m_TXCR;                    // 0x0008
   UInt32 m_TXT0;                    // 0x000C
   UInt32 m_TSDR;                    // 0x0010
   UInt32 m_MSWTR_0;                 // 0x0014
   UInt32 m_MSWTR_1;                 // 0x0018
   UInt32 m_TXSLBUFSZ;               // 0x001C
   UInt32 RESERVED_40_1C[8];
   UInt32 m_TDRFCR;                  // 0x0040
   UInt32 m_DRFLPM;                  // 0x0044
   UInt32 m_DRFPRE_0;                // 0x0048
   UInt32 m_DRFPRE_1;                // 0x004C
   UInt32 m_DRFPRE_2;                // 0x0050
   UInt32 m_DRFPRE_3;                // 0x0054
   UInt32 m_DRFPOS_0;                // 0x0058
   UInt32 m_DRFPOS_1;                // 0x005C
   UInt32 m_DRFPOS_2;                // 0x0060
   UInt32 m_DRFPOS_3;                // 0x0064
   UInt32 RESERVED_80_64[6];
   UInt32 m_TRDR_0;                  // 0x0080
   UInt32 m_TRDR_1;                  // 0x0084
   UInt32 m_TRDR_2;                  // 0x0088
   UInt32 m_TRDR_3;                  // 0x008C
   UInt32 m_TRDR_4;                  // 0x0090
   UInt32 m_TRDR_5;                  // 0x0094
   UInt32 m_TRDR_6;                  // 0x0098
   UInt32 RESERVED_BC_98[8];
   UInt32 m_AMPCR;                   // 0x00BC
   UInt32 m_TPR0_0;                  // 0x00C0
   UInt32 m_TPR0_1;                  // 0x00C4
   UInt32 m_TPR0_2;                  // 0x00C8
   UInt32 m_TPR0_3;                  // 0x00CC
   UInt32 m_TPR0_4;                  // 0x00D0
   UInt32 m_TPR0_5;                  // 0x00D4
   UInt32 m_TPR0_6;                  // 0x00D8
   UInt32 m_TPR0_7;                  // 0x00DC
   UInt32 m_TPR1_0;                  // 0x00E0
   UInt32 m_TPR1_1;                  // 0x00E4
   UInt32 m_TPR1_2;                  // 0x00E8
   UInt32 m_TPR1_3;                  // 0x00EC
   UInt32 m_TPR1_4;                  // 0x00F0
   UInt32 m_TPR1_5;                  // 0x00F4
   UInt32 m_TPR1_6;                  // 0x00F8
   UInt32 m_TPR1_7;                  // 0x00FC
   UInt32 m_TPR2_0;                  // 0x0100
   UInt32 m_TPR2_1;                  // 0x0104
   UInt32 m_TPR2_2;                  // 0x0108
   UInt32 m_TPR2_3;                  // 0x010C
   UInt32 m_TPR2_4;                  // 0x0110
   UInt32 m_TPR2_5;                  // 0x0114
   UInt32 m_TPR2_6;                  // 0x0118
   UInt32 m_TPR2_7;                  // 0x011C
   UInt32 m_TPR3_0;                  // 0x0120
   UInt32 m_TPR3_1;                  // 0x0124
   UInt32 m_TPR3_2;                  // 0x0128
   UInt32 m_TPR3_3;                  // 0x012C
   UInt32 m_TPR3_4;                  // 0x0130
   UInt32 m_TPR3_5;                  // 0x0134
   UInt32 m_TPR3_6;                  // 0x0138
   UInt32 m_TPR3_7;                  // 0x013C
   UInt32 m_TPR4_0;                  // 0x0140
   UInt32 m_TPR4_1;                  // 0x0144
   UInt32 m_TPR4_2;                  // 0x0148
   UInt32 m_TPR4_3;                  // 0x014C
   UInt32 m_TPR4_4;                  // 0x0150
   UInt32 m_TPR4_5;                  // 0x0154
   UInt32 m_TPR4_6;                  // 0x0158
   UInt32 m_TPR4_7;                  // 0x015C
   UInt32 m_TPR5_0;                  // 0x0160
   UInt32 m_TPR5_1;                  // 0x0164
   UInt32 m_TPR5_2;                  // 0x0168
   UInt32 m_TPR5_3;                  // 0x016C
   UInt32 m_TPR5_4;                  // 0x0170
   UInt32 m_TPR5_5;                  // 0x0174
   UInt32 m_TPR5_6;                  // 0x0178
   UInt32 m_TPR5_7;                  // 0x017C
   UInt32 m_TPR6_0;                  // 0x0180
   UInt32 m_TPR6_1;                  // 0x0184
   UInt32 m_TPR6_2;                  // 0x0188
   UInt32 m_TPR6_3;                  // 0x018C
   UInt32 m_TPR6_4;                  // 0x0190
   UInt32 m_TPR6_5;                  // 0x0194
   UInt32 m_TPR6_6;                  // 0x0198
   UInt32 m_TPR6_7;                  // 0x019C
} BRCM_RFBB_TX2G_REGS;


#endif /* __BRCM_RDB_RFBB_TX2G_H__ */


