/************************************************************************************************/
/*                                                                                              */
/*  Copyright 2010  Broadcom Corporation                                                        */
/*                                                                                              */
/*     Unless you and Broadcom execute a separate written software license agreement governing  */
/*     use of this software, this software is licensed to you under the terms of the GNU        */
/*     General Public License version 2 (the GPL), available at                                 */
/*                                                                                              */
/*          http://www.broadcom.com/licenses/GPLv2.php                                          */
/*                                                                                              */
/*     with the following added to such license:                                                */
/*                                                                                              */
/*     As a special exception, the copyright holders of this software give you permission to    */
/*     link this software with independent modules, and to copy and distribute the resulting    */
/*     executable under terms of your choice, provided that you also meet, for each linked      */
/*     independent module, the terms and conditions of the license of that module.              */
/*     An independent module is a module which is not derived from this software.  The special  */
/*     exception does not apply to any modifications of the software.                           */
/*                                                                                              */
/*     Notwithstanding the above, under no circumstances may you combine this software in any   */
/*     way with any other Broadcom software provided under a license other than the GPL,        */
/*     without Broadcom's express prior written consent.                                        */
/*                                                                                              */
/*     Date     : Generated on 11/9/2010 1:17:6                                             */
/*     RDB file : //R4/                                                                   */
/************************************************************************************************/

#ifndef __BRCM_RDB_NMS_MODEMBUS_ADDR_REMAP_H__
#define __BRCM_RDB_NMS_MODEMBUS_ADDR_REMAP_H__

#define NMS_MODEMBUS_ADDR_REMAP_REG0_OFFSET                               0x00000000
#define NMS_MODEMBUS_ADDR_REMAP_REG0_TYPE                                 UInt32
#define NMS_MODEMBUS_ADDR_REMAP_REG0_RESERVED_MASK                        0x00000000
#define    NMS_MODEMBUS_ADDR_REMAP_REG0_ADDR_REMAP_REG0_31TO18_SHIFT      18
#define    NMS_MODEMBUS_ADDR_REMAP_REG0_ADDR_REMAP_REG0_31TO18_MASK       0xFFFC0000
#define    NMS_MODEMBUS_ADDR_REMAP_REG0_RESERVED_17TO0_SHIFT              0
#define    NMS_MODEMBUS_ADDR_REMAP_REG0_RESERVED_17TO0_MASK               0x0003FFFF

#define NMS_MODEMBUS_ADDR_REMAP_REG1_OFFSET                               0x00000004
#define NMS_MODEMBUS_ADDR_REMAP_REG1_TYPE                                 UInt32
#define NMS_MODEMBUS_ADDR_REMAP_REG1_RESERVED_MASK                        0x00000000
#define    NMS_MODEMBUS_ADDR_REMAP_REG1_ADDR_REMAP_REG1_31TO18_SHIFT      18
#define    NMS_MODEMBUS_ADDR_REMAP_REG1_ADDR_REMAP_REG1_31TO18_MASK       0xFFFC0000
#define    NMS_MODEMBUS_ADDR_REMAP_REG1_RESERVED_17TO0_SHIFT              0
#define    NMS_MODEMBUS_ADDR_REMAP_REG1_RESERVED_17TO0_MASK               0x0003FFFF

#define NMS_MODEMBUS_ADDR_REMAP_REG2_OFFSET                               0x00000008
#define NMS_MODEMBUS_ADDR_REMAP_REG2_TYPE                                 UInt32
#define NMS_MODEMBUS_ADDR_REMAP_REG2_RESERVED_MASK                        0x00000000
#define    NMS_MODEMBUS_ADDR_REMAP_REG2_ADDR_REMAP_REG2_31TO18_SHIFT      18
#define    NMS_MODEMBUS_ADDR_REMAP_REG2_ADDR_REMAP_REG2_31TO18_MASK       0xFFFC0000
#define    NMS_MODEMBUS_ADDR_REMAP_REG2_RESERVED_17TO0_SHIFT              0
#define    NMS_MODEMBUS_ADDR_REMAP_REG2_RESERVED_17TO0_MASK               0x0003FFFF

#define NMS_MODEMBUS_ADDR_REMAP_REG3_OFFSET                               0x0000000C
#define NMS_MODEMBUS_ADDR_REMAP_REG3_TYPE                                 UInt32
#define NMS_MODEMBUS_ADDR_REMAP_REG3_RESERVED_MASK                        0x00000000
#define    NMS_MODEMBUS_ADDR_REMAP_REG3_ADDR_REMAP_REG3_31TO18_SHIFT      18
#define    NMS_MODEMBUS_ADDR_REMAP_REG3_ADDR_REMAP_REG3_31TO18_MASK       0xFFFC0000
#define    NMS_MODEMBUS_ADDR_REMAP_REG3_RESERVED_17TO0_SHIFT              0
#define    NMS_MODEMBUS_ADDR_REMAP_REG3_RESERVED_17TO0_MASK               0x0003FFFF

#define NMS_MODEMBUS_ADDR_REMAP_REG4_OFFSET                               0x00000010
#define NMS_MODEMBUS_ADDR_REMAP_REG4_TYPE                                 UInt32
#define NMS_MODEMBUS_ADDR_REMAP_REG4_RESERVED_MASK                        0x00000000
#define    NMS_MODEMBUS_ADDR_REMAP_REG4_ADDR_REMAP_REG4_31TO18_SHIFT      18
#define    NMS_MODEMBUS_ADDR_REMAP_REG4_ADDR_REMAP_REG4_31TO18_MASK       0xFFFC0000
#define    NMS_MODEMBUS_ADDR_REMAP_REG4_RESERVED_17TO0_SHIFT              0
#define    NMS_MODEMBUS_ADDR_REMAP_REG4_RESERVED_17TO0_MASK               0x0003FFFF

#define NMS_MODEMBUS_ADDR_REMAP_REG5_OFFSET                               0x00000014
#define NMS_MODEMBUS_ADDR_REMAP_REG5_TYPE                                 UInt32
#define NMS_MODEMBUS_ADDR_REMAP_REG5_RESERVED_MASK                        0x00000000
#define    NMS_MODEMBUS_ADDR_REMAP_REG5_ADDR_REMAP_REG5_31TO18_SHIFT      18
#define    NMS_MODEMBUS_ADDR_REMAP_REG5_ADDR_REMAP_REG5_31TO18_MASK       0xFFFC0000
#define    NMS_MODEMBUS_ADDR_REMAP_REG5_RESERVED_17TO0_SHIFT              0
#define    NMS_MODEMBUS_ADDR_REMAP_REG5_RESERVED_17TO0_MASK               0x0003FFFF

#define NMS_MODEMBUS_ADDR_REMAP_REG6_OFFSET                               0x00000018
#define NMS_MODEMBUS_ADDR_REMAP_REG6_TYPE                                 UInt32
#define NMS_MODEMBUS_ADDR_REMAP_REG6_RESERVED_MASK                        0x00000000
#define    NMS_MODEMBUS_ADDR_REMAP_REG6_ADDR_REMAP_REG6_31TO18_SHIFT      18
#define    NMS_MODEMBUS_ADDR_REMAP_REG6_ADDR_REMAP_REG6_31TO18_MASK       0xFFFC0000
#define    NMS_MODEMBUS_ADDR_REMAP_REG6_RESERVED_17TO0_SHIFT              0
#define    NMS_MODEMBUS_ADDR_REMAP_REG6_RESERVED_17TO0_MASK               0x0003FFFF

#define NMS_MODEMBUS_ADDR_REMAP_REG7_OFFSET                               0x0000001C
#define NMS_MODEMBUS_ADDR_REMAP_REG7_TYPE                                 UInt32
#define NMS_MODEMBUS_ADDR_REMAP_REG7_RESERVED_MASK                        0x00000000
#define    NMS_MODEMBUS_ADDR_REMAP_REG7_ADDR_REMAP_REG7_31TO0_SHIFT       0
#define    NMS_MODEMBUS_ADDR_REMAP_REG7_ADDR_REMAP_REG7_31TO0_MASK        0xFFFFFFFF

typedef volatile struct {
   UInt32 m_REG0;                    // 0x0000
   UInt32 m_REG1;                    // 0x0004
   UInt32 m_REG2;                    // 0x0008
   UInt32 m_REG3;                    // 0x000C
   UInt32 m_REG4;                    // 0x0010
   UInt32 m_REG5;                    // 0x0014
   UInt32 m_REG6;                    // 0x0018
   UInt32 m_REG7;                    // 0x001C
} BRCM_NMS_MODEMBUS_ADDR_REMAP_REGS;


#endif /* __BRCM_RDB_NMS_MODEMBUS_ADDR_REMAP_H__ */


