/************************************************************************************************/
/*                                                                                              */
/*  Copyright 2010  Broadcom Corporation                                                        */
/*                                                                                              */
/*     Unless you and Broadcom execute a separate written software license agreement governing  */
/*     use of this software, this software is licensed to you under the terms of the GNU        */
/*     General Public License version 2 (the GPL), available at                                 */
/*                                                                                              */
/*          http://www.broadcom.com/licenses/GPLv2.php                                          */
/*                                                                                              */
/*     with the following added to such license:                                                */
/*                                                                                              */
/*     As a special exception, the copyright holders of this software give you permission to    */
/*     link this software with independent modules, and to copy and distribute the resulting    */
/*     executable under terms of your choice, provided that you also meet, for each linked      */

#define RFBB_SCHDLR_SMCRD_EXT26_RESERVED_MASK                             0xFFFFFFF0
#define    RFBB_SCHDLR_SMCRD_EXT26_SMCRD_EXT26_SHIFT                      0
#define    RFBB_SCHDLR_SMCRD_EXT26_SMCRD_EXT26_MASK                       0x0000000F

#define RFBB_SCHDLR_SMCRD_EXT27_OFFSET                                    0x0000022C
#define RFBB_SCHDLR_SMCRD_EXT27_TYPE                                      UInt32
#define RFBB_SCHDLR_SMCRD_EXT27_RESERVED_MASK                             0xFFFFFFF0
#define    RFBB_SCHDLR_SMCRD_EXT27_SMCRD_EXT27_SHIFT                      0
#define    RFBB_SCHDLR_SMCRD_EXT27_SMCRD_EXT27_MASK                       0x0000000F

#define RFBB_SCHDLR_SMCRD_EXT28_OFFSET                                    0x00000230
#define RFBB_SCHDLR_SMCRD_EXT28_TYPE                                      UInt32
#define RFBB_SCHDLR_SMCRD_EXT28_RESERVED_MASK                             0xFFFFFFF0
#define    RFBB_SCHDLR_SMCRD_EXT28_SMCRD_EXT28_SHIFT                      0
#define    RFBB_SCHDLR_SMCRD_EXT28_SMCRD_EXT28_MASK                       0x0000000F

#define RFBB_SCHDLR_SMCRD_EXT29_OFFSET                                    0x00000234
#define RFBB_SCHDLR_SMCRD_EXT29_TYPE                                      UInt32
#define RFBB_SCHDLR_SMCRD_EXT29_RESERVED_MASK                             0xFFFFFFF0
#define    RFBB_SCHDLR_SMCRD_EXT29_SMCRD_EXT29_SHIFT                      0
#define    RFBB_SCHDLR_SMCRD_EXT29_SMCRD_EXT29_MASK                       0x0000000F

#define RFBB_SCHDLR_SMCRD_EXT30_OFFSET                                    0x00000238
#define RFBB_SCHDLR_SMCRD_EXT30_TYPE                                      UInt32
#define RFBB_SCHDLR_SMCRD_EXT30_RESERVED_MASK                             0xFFFFFFF0
#define    RFBB_SCHDLR_SMCRD_EXT30_SMCRD_EXT30_SHIFT                      0
#define    RFBB_SCHDLR_SMCRD_EXT30_SMCRD_EXT30_MASK                       0x0000000F

#define RFBB_SCHDLR_SMCRD_EXT31_OFFSET                                    0x0000023C
#define RFBB_SCHDLR_SMCRD_EXT31_TYPE                                      UInt32
#define RFBB_SCHDLR_SMCRD_EXT31_RESERVED_MASK                             0xFFFFFFF0
#define    RFBB_SCHDLR_SMCRD_EXT31_SMCRD_EXT31_SHIFT                      0
#define    RFBB_SCHDLR_SMCRD_EXT31_SMCRD_EXT31_MASK                       0x0000000F

#define RFBB_SCHDLR_POWER_HOLD_OFFSET                                     0x00000240
#define RFBB_SCHDLR_POWER_HOLD_TYPE                                       UInt32
#define RFBB_SCHDLR_POWER_HOLD_RESERVED_MASK                              0xFFFFFEEE
#define    RFBB_SCHDLR_POWER_HOLD_POWER_HOLD_MASK_SHIFT                   8
#define    RFBB_SCHDLR_POWER_HOLD_POWER_HOLD_MASK_MASK                    0x00000100
#define    RFBB_SCHDLR_POWER_HOLD_POWER_HOLD_FORCE_SHIFT                  4
#define    RFBB_SCHDLR_POWER_HOLD_POWER_HOLD_FORCE_MASK                   0x00000010
#define    RFBB_SCHDLR_POWER_HOLD_POWER_HOLD_RAW_SHIFT                    0
#define    RFBB_SCHDLR_POWER_HOLD_POWER_HOLD_RAW_MASK                     0x00000001

typedef volatile struct {
   UInt32 m_SMCESR0;                 // 0x0000
   UInt32 m_SMCESR1;                 // 0x0004
   UInt32 m_CMDBUF_ADDR;             // 0x0008
   UInt32 RESERVED_10_8[1];
   UInt32 m_CMDBUF_RD;               // 0x0010
   UInt32 m_CMDBUF_WR;               // 0x0014
   UInt32 m_CMDBUF_SEL;              // 0x0018
   UInt32 m_SPI_CLK_FREQ_CNT;        // 0x001C
   UInt32 m_CMD_GAP;                 // 0x0020
   UInt32 m_RFIC_SCHEDULER_EN;       // 0x0024
   UInt32 m_MT_SHADOW_EN;            // 0x0028
   UInt32 m_IMR;                     // 0x002C
   UInt32 m_ISTAT;                   // 0x0030
   UInt32 m_ISTAT_CLR;               // 0x0034
   UInt32 m_TWIF_RD_CFG;             // 0x0038
   UInt32 m_RF_SPI_CLK_SEL;          // 0x003C
   UInt32 m_SMCECR0;                 // 0x0040
   UInt32 m_SMCECR1;                 // 0x0044
   UInt32 m_SMCECR2;                 // 0x0048
   UInt32 m_SMCECR3;                 // 0x004C
   UInt32 m_SMCECR4;                 // 0x0050
   UInt32 m_SMCECR5;                 // 0x0054
   UInt32 m_SMCECR6;                 // 0x0058
   UInt32 m_SMCECR7;                 // 0x005C
   UInt32 m_SMCECR8;                 // 0x0060
   UInt32 m_SMCECR9;                 // 0x0064
   UInt32 m_SMCECR10;                // 0x0068
   UInt32 m_SMCECR11;                // 0x006C
   UInt32 m_SMCECR12;                // 0x0070
   UInt32 m_SMCECR13;                // 0x0074
   UInt32 m_SMCECR14;                // 0x0078
   UInt32 m_SMCECR15;                // 0x007C
   UInt32 m_SMCECR16;                // 0x0080
   UInt32 m_SMCECR17;                // 0x0084
   UInt32 m_SMCECR18;                // 0x0088
   UInt32 m_SMCECR19;                // 0x008C
   UInt32 m_SMCECR20;                // 0x0090
   UInt32 m_SMCECR21;                // 0x0094
   UInt32 m_SMCECR22;                // 0x0098
   UInt32 m_SMCECR23;                // 0x009C
   UInt32 m_SMCECR24;                // 0x00A0
   UInt32 m_SMCECR25;                // 0x00A4
   UInt32 m_SMCECR26;                // 0x00A8
   UInt32 m_SMCECR27;                // 0x00AC
   UInt32 m_SMCECR28;                // 0x00B0
   UInt32 m_SMCECR29;                // 0x00B4
   UInt32 m_SMCECR30;                // 0x00B8
   UInt32 m_SMCECR31;                // 0x00BC
   UInt32 m_SMCRD0;                  // 0x00C0
   UInt32 m_SMCRD1;                  // 0x00C4
   UInt32 m_SMCRD2;                  // 0x00C8
   UInt32 m_SMCRD3;                  // 0x00CC
   UInt32 m_SMCRD4;                  // 0x00D0
   UInt32 m_SMCRD5;                  // 0x00D4
   UInt32 m_SMCRD6;                  // 0x00D8
   UInt32 m_SMCRD7;                  // 0x00DC
   UInt32 m_SMCRD8;                  // 0x00E0
   UInt32 m_SMCRD9;                  // 0x00E4
   UInt32 m_SMCRD10;                 // 0x00E8
   UInt32 m_SMCRD11;                 // 0x00EC
   UInt32 m_SMCRD12;                 // 0x00F0
   UInt32 m_SMCRD13;                 // 0x00F4
   UInt32 m_SMCRD14;                 // 0x00F8
   UInt32 m_SMCRD15;                 // 0x00FC
   UInt32 m_SMCRD16;                 // 0x0100
   UInt32 m_SMCRD17;                 // 0x0104
   UInt32 m_SMCRD18;                 // 0x0108
   UInt32 m_SMCRD19;                 // 0x010C
   UInt32 m_SMCRD20;                 // 0x0110
   UInt32 m_SMCRD21;                 // 0x0114
   UInt32 m_SMCRD22;                 // 0x0118
   UInt32 m_SMCRD23;                 // 0x011C
   UInt32 m_SMCRD24;                 // 0x0120
   UInt32 m_SMCRD25;                 // 0x0124
   UInt32 m_SMCRD26;                 // 0x0128
   UInt32 m_SMCRD27;                 // 0x012C
   UInt32 m_SMCRD28;                 // 0x0130
   UInt32 m_SMCRD29;                 // 0x0134
   UInt32 m_SMCRD30;                 // 0x0138
   UInt32 m_SMCRD31;                 // 0x013C
   UInt32 m_SMCGPPC0;                // 0x0140
   UInt32 m_SMCGPPC2;                // 0x0144
   UInt32 m_SMCGPPC4;                // 0x0148
   UInt32 m_SMCGPPC6;                // 0x014C
   UInt32 m_SMCGPPC8;                // 0x0150
   UInt32 m_SMCGPPC10;               // 0x0154
   UInt32 m_SMCGPPC12;               // 0x0158
   UInt32 m_SMCGPPC14;               // 0x015C
   UInt32 RESERVED_180_15C[8];
   UInt32 m_TWIF_CFG_RD0;            // 0x0180
   UInt32 m_TWIF_CFG_RD1;            // 0x0184
   UInt32 m_TWIF_CFG_WR0;            // 0x0188
   UInt32 m_TWIF_CFG_WR1;            // 0x018C
   UInt32 m_TWIF_DATA_LOC;           // 0x0190
   UInt32 m_SMCECR_ENABLE;           // 0x0194
   UInt32 m_SMCECR_ENABLE_SET;       // 0x0198
   UInt32 m_SMCECR_ENABLE_CLR;       // 0x019C
   UInt32 RESERVED_1C0_19C[8];
   UInt32 m_SMCRD_EXT0;              // 0x01C0
   UInt32 m_SMCRD_EXT1;              // 0x01C4
   UInt32 m_SMCRD_EXT2;              // 0x01C8
   UInt32 m_SMCRD_EXT3;              // 0x01CC
   UInt32 m_SMCRD_EXT4;              // 0x01D0
   UInt32 m_SMCRD_EXT5;              // 0x01D4
   UInt32 m_SMCRD_EXT6;              // 0x01D8
   UInt32 m_SMCRD_EXT7;              // 0x01DC
   UInt32 m_SMCRD_EXT8;              // 0x01E0
   UInt32 m_SMCRD_EXT9;              // 0x01E4
   UInt32 m_SMCRD_EXT10;             // 0x01E8
   UInt32 m_SMCRD_EXT11;             // 0x01EC
   UInt32 m_SMCRD_EXT12;             // 0x01F0
   UInt32 m_SMCRD_EXT13;             // 0x01F4
   UInt32 m_SMCRD_EXT14;             // 0x01F8
   UInt32 m_SMCRD_EXT15;             // 0x01FC
   UInt32 m_SMCRD_EXT16;             // 0x0200
   UInt32 m_SMCRD_EXT17;             // 0x0204
   UInt32 m_SMCRD_EXT18;             // 0x0208
   UInt32 m_SMCRD_EXT19;             // 0x020C
   UInt32 m_SMCRD_EXT20;             // 0x0210
   UInt32 m_SMCRD_EXT21;             // 0x0214
   UInt32 m_SMCRD_EXT22;             // 0x0218
   UInt32 m_SMCRD_EXT23;             // 0x021C
   UInt32 m_SMCRD_EXT24;             // 0x0220
   UInt32 m_SMCRD_EXT25;             // 0x0224
   UInt32 m_SMCRD_EXT26;             // 0x0228
   UInt32 m_SMCRD_EXT27;             // 0x022C
   UInt32 m_SMCRD_EXT28;             // 0x0230
   UInt32 m_SMCRD_EXT29;             // 0x0234
   UInt32 m_SMCRD_EXT30;             // 0x0238
   UInt32 m_SMCRD_EXT31;             // 0x023C
   UInt32 m_POWER_HOLD;              // 0x0240
} BRCM_RFBB_SCHDLR_REGS;


#endif /* __BRCM_RDB_RFBB_SCHDLR_H__ */


