/***************************************************************************
 *     Copyright (c) 1999-2010, Broadcom Corporation
 *
 *
 *  Unless you and Broadcom execute a separate written software license
 * agreement governing use of this software, this software is licensed to you
 * under the terms of the GNU General Public License version 2 (the "GPL"),
 * available at http://www.broadcom.com/licenses/GPLv2.php, with the
 * following added to such license:
 *
 *
 *  As a special exception, the copyright holders of this software give you
 * permission to link this software with independent modules, and to copy
 * and distribute the resulting executable under terms of your choice,
 * provided that you also meet, for each linked independent module, the terms
 * and conditions of the license of that module.  An independent module is a
 * module which is not derived from this software.  The special exception
 * does not apply to any modifications of the software.
 *
 *
 *  Notwithstanding the above, under no circumstances may you combine this
 * software in any way with any other Broadcom software provided under a
 * license other than the GPL, without Broadcom's express prior written
 * consent.
 *
 * $brcm_Workfile: $
 * $brcm_Revision: $
 * $brcm_Date: $
 *
 * Module Description:
 *                     DO NOT EDIT THIS FILE DIRECTLY
 *
 * This module was generated magically with RDB from a source description

 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/tx.rdb
 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/wcdma_gpio.
 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/wcdma_gp_ti
 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/wcdma_uart.
 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/rfic_schedu
 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/bb_tx_filte
 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/dsp_cpmr.rd
 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/dsp_tl3r.rd
 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/dsp_intc.rd
 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/dsp_tpif.rd
 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/dsp_cipher.
 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/dsp_equaliz
 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/dsp_evnt_ct
 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/dsp_rf_gpo.
 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/dsp_rf_spi.
 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/dsp_3_wire_
 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/dsp_sys_tim
 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/dsp_2g_digr
 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/dsp_ac.rdb
 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/dsp_rx_cont
 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/dsp_tx_cont
 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/dsp_audio.r
 *             /projects/athena_ext4/revB0/users/aytong/sandbox/athena_revB0/design_database/athena_chip/rdb/dsp_pcm.rdb
 *
 * Revision History:
 *
 * $brcm_Log: $
 *
 ***************************************************************************/

#ifndef __ATHENA_AHB_TL3R_H__
#define __ATHENA_AHB_TL3R_H__

/****  AHB_TL3R  ****/
//#define AHB_TL3R_BASE_ADDR      0x30400000      /* AHB_TL3R core */

typedef volatile struct {
    UInt32  m_AHB_TL3R_TL3_SHM_CFG_R0;                            // 000
    UInt32  m_AHB_TL3R_TL3_SHM_CFG_R1;                            // 004
    UInt32  m_AHB_TL3R_TL3_SHM_CFG_R2;                            // 008
    UInt32  m_AHB_TL3R_TL3_SHM_CFG_R3;                            // 00C
    UInt32  m_AHB_TL3R_TL3_SHM_CFG_R4;                            // 010
    UInt32  m_AHB_TL3R_TL3_SHM_CFG_R5;                            // 014
    UInt32  m_AHB_TL3R_TL3_SHM_CFG_R6;                            // 018
    UInt32  m_AHB_TL3R_TL3_SHM_CFG_R7;                            // 01C
    UInt32  m_RESERVED_020[1];                                  // 020
    UInt32  m_AHB_TL3R_TL3_CFG_R;                                 // 024
    UInt32  m_AHB_TL3R_TL3_A2D_ACCESS_EN2_R;                      // 028
    UInt32  m_AHB_TL3R_TL3_A2D_ACCESS_EN_R;                       // 02C
    UInt32  m_AHB_TL3R_TL3_STA_R;                                 // 030
    UInt32  m_AHB_TL3R_TL3_NMI_DISABLE_R;                         // 034
    UInt32  m_AHB_TL3R_TL3_TEST_R;                                // 038
    UInt32  m_AHB_TL3R_TL3_CTRL_REG;                              // 03C
    UInt32  m_AHB_TL3R_TL3_SLEEP_MONITOR_REG;                     // 040
} BCMRDB_AHB_TL3R_REGS;

/****  AHB_TL3R  ****/
#define AHB_TL3R_TL3_SHM_CFG_R0          (AHB_TL3R_BASE_ADDR + 0x0000)  /* ARM TL3 Shared Memory Configuration Regist */
  #define AHB_TL3R_TL3_SHM_CFG_R0_sm_base_addr_31to13       0xFFFFE000
                                                       /* RW Shared Memory Base Address[31:13]. (default=0x06000000), */
  #define AHB_TL3R_TL3_SHM_CFG_R0_reserved_12to9       0x1E00
                                                                       /* RO Reserved. If write, should write all 0., */
  #define AHB_TL3R_TL3_SHM_CFG_R0_addr_mode          0x0100                                     /* RW Address method  */
  #define AHB_TL3R_TL3_SHM_CFG_R0_reserved_7to7       0x0080
                                                                       /* RO Reserved. If write, should write all 0., */
  #define AHB_TL3R_TL3_SHM_CFG_R0_rbuf_adaptive_en       0x0040
