/************************************************************************************************/
/*                                                                                              */
/*  Copyright 2010  Broadcom Corporation                                                        */
/*                                                                                              */
/*     Unless you and Broadcom execute a separate written software license agreement governing  */
/*     use of this software, this software is licensed to you under the terms of the GNU        */
/*     General Public License version 2 (the GPL), available at                                 */
/*                                                                                              */
/*          http://www.broadcom.com/licenses/GPLv2.php                                          */
/*                                                                                              */
/*     with the following added to such license:                                                */
/*                                                                                              */
/*     As a special exception, the copyright holders of this software give you permission to    */
/*     link this software with independent modules, and to copy and distribute the resulting    */
/*     executable under terms of your choice, provided that you also meet, for each linked      */

#define    SYSCFG_BRIDGE_INCR_EN_DSP_ASYNC_BRG_ZSM_RD_INCR_EN_SHIFT       15
#define    SYSCFG_BRIDGE_INCR_EN_DSP_ASYNC_BRG_ZSM_RD_INCR_EN_MASK        0x00008000
#define    SYSCFG_BRIDGE_INCR_EN_DSP_ASYNC_BRG_ZSM_WR_INCR_EN_SHIFT       14
#define    SYSCFG_BRIDGE_INCR_EN_DSP_ASYNC_BRG_ZSM_WR_INCR_EN_MASK        0x00004000
#define    SYSCFG_BRIDGE_INCR_EN_DSP_ASYNC_BRG_ICACHE_RD_INCR_EN_SHIFT    13
#define    SYSCFG_BRIDGE_INCR_EN_DSP_ASYNC_BRG_ICACHE_RD_INCR_EN_MASK     0x00002000
#define    SYSCFG_BRIDGE_INCR_EN_DSP_ASYNC_BRG_ICACHE_WR_INCR_EN_SHIFT    12
#define    SYSCFG_BRIDGE_INCR_EN_DSP_ASYNC_BRG_ICACHE_WR_INCR_EN_MASK     0x00001000
#define    SYSCFG_BRIDGE_INCR_EN_DSP_ASYNC_BRG_SLAVE_RD_INCR_EN_SHIFT     11
#define    SYSCFG_BRIDGE_INCR_EN_DSP_ASYNC_BRG_SLAVE_RD_INCR_EN_MASK      0x00000800
#define    SYSCFG_BRIDGE_INCR_EN_DSP_ASYNC_BRG_SLAVE_WR_INCR_EN_SHIFT     10
#define    SYSCFG_BRIDGE_INCR_EN_DSP_ASYNC_BRG_SLAVE_WR_INCR_EN_MASK      0x00000400
#define    SYSCFG_BRIDGE_INCR_EN_ML2MH_SYNC_BRG_RD_INCR_EN_SHIFT          9
#define    SYSCFG_BRIDGE_INCR_EN_ML2MH_SYNC_BRG_RD_INCR_EN_MASK           0x00000200
#define    SYSCFG_BRIDGE_INCR_EN_ML2MH_SYNC_BRG_WR_INCR_EN_SHIFT          8
#define    SYSCFG_BRIDGE_INCR_EN_ML2MH_SYNC_BRG_WR_INCR_EN_MASK           0x00000100
#define    SYSCFG_BRIDGE_INCR_EN_MH2ML_SYNC_BRG_RD_INCR_EN_SHIFT          7
#define    SYSCFG_BRIDGE_INCR_EN_MH2ML_SYNC_BRG_RD_INCR_EN_MASK           0x00000080
#define    SYSCFG_BRIDGE_INCR_EN_MH2ML_SYNC_BRG_WR_INCR_EN_SHIFT          6
#define    SYSCFG_BRIDGE_INCR_EN_MH2ML_SYNC_BRG_WR_INCR_EN_MASK           0x00000040
#define    SYSCFG_BRIDGE_INCR_EN_MA11D_SYNC_BRG_RD_INCR_EN_SHIFT          5
#define    SYSCFG_BRIDGE_INCR_EN_MA11D_SYNC_BRG_RD_INCR_EN_MASK           0x00000020
#define    SYSCFG_BRIDGE_INCR_EN_MA11D_SYNC_BRG_WR_INCR_EN_SHIFT          4
#define    SYSCFG_BRIDGE_INCR_EN_MA11D_SYNC_BRG_WR_INCR_EN_MASK           0x00000010
#define    SYSCFG_BRIDGE_INCR_EN_VID_ENC_SYNC_BRG_RD_INCR_EN_SHIFT        3
#define    SYSCFG_BRIDGE_INCR_EN_VID_ENC_SYNC_BRG_RD_INCR_EN_MASK         0x00000008
#define    SYSCFG_BRIDGE_INCR_EN_VID_ENC_SYNC_BRG_WR_INCR_EN_SHIFT        2
#define    SYSCFG_BRIDGE_INCR_EN_VID_ENC_SYNC_BRG_WR_INCR_EN_MASK         0x00000004
#define    SYSCFG_BRIDGE_INCR_EN_VID_DEC_SYNC_BRG_RD_INCR_EN_SHIFT        1
#define    SYSCFG_BRIDGE_INCR_EN_VID_DEC_SYNC_BRG_RD_INCR_EN_MASK         0x00000002
#define    SYSCFG_BRIDGE_INCR_EN_VID_DEC_SYNC_BRG_WR_INCR_EN_SHIFT        0
#define    SYSCFG_BRIDGE_INCR_EN_VID_DEC_SYNC_BRG_WR_INCR_EN_MASK         0x00000001

#define SYSCFG_FPGA_VERSION_OFFSET                                        0x000001FC
#define SYSCFG_FPGA_VERSION_TYPE                                          UInt32
#define SYSCFG_FPGA_VERSION_RESERVED_MASK                                 0xFFFFFF00
#define    SYSCFG_FPGA_VERSION_FPGA_RLS_ID_SHIFT                          0
#define    SYSCFG_FPGA_VERSION_FPGA_RLS_ID_MASK                           0x000000FF


//*****old style:

typedef volatile struct {
    UInt32  m_SYSCFG_IOCR0;                                       // 000
    UInt32  m_SYSCFG_IOCR1;                                       // 004
    UInt32  m_SYSCFG_SUCR;                                        // 008
    UInt32  m_SYSCFG_IOCR2;                                       // 00C
    UInt32  m_SYSCFG_PIDR;                                        // 010
    UInt32  m_SYSCFG_DSPCTRL;                                     // 014
    UInt32  m_SYSCFG_PUMR;                                        // 018
    UInt32  m_SYSCFG_IOCR3;                                       // 01C
    UInt32  m_SYSCFG_IOCR4;                                       // 020
    UInt32  m_SYSCFG_IOCR5;                                       // 024
    UInt32  m_SYSCFG_IOCR6;                                       // 028
    UInt32  m_SYSCFG_IOCR7;                                       // 02C
    UInt32  m_RESERVED_030[1];                                  // 030
    UInt32  m_SYSCFG_TVENCCR;                                     // 034
    UInt32  m_SYSCFG_DSICR;                                       // 038
    UInt32  m_RESERVED_03C[1];                                  // 03C
    UInt32  m_SYSCFG_MCR;                                         // 040
    UInt32  m_SYSCFG_MRR;                                         // 044
    UInt32  m_SYSCFG_RAMCTRL;                                     // 048
    UInt32  m_RESERVED_04C[1];                                  // 04C
    UInt32  m_SYSCFG_SECCTRL;                                     // 050
    UInt32  m_SYSCFG_SECSTAT;                                     // 054
    UInt32  m_SYSCFG_MARM11CR;                                    // 058
    UInt32  m_RESERVED_05C[1];                                  // 05C
    UInt32  m_SYSCFG_MAMBACR;                                     // 060
    UInt32  m_SYSCFG_RFCR;                                        // 064
    UInt32  m_RESERVED_068[6];                                  // 068-080
    UInt32  m_SYSCFG_ANACR0;                                      // 080
    UInt32  m_SYSCFG_ANACR1;                                      // 084
    UInt32  m_SYSCFG_ANACR2;                                      // 088
    UInt32  m_SYSCFG_ANACR3;                                      // 08C
    UInt32  m_SYSCFG_ANACR4;                                      // 090
    UInt32  m_SYSCFG_ANACR5;                                      // 094
    UInt32  m_SYSCFG_ANACR6;                                      // 098
    UInt32  m_SYSCFG_ANACR7;                                      // 09C
    UInt32  m_SYSCFG_ANACR8;                                      // 0A0
    UInt32  m_SYSCFG_ANACR9;                                      // 0A4
    UInt32  m_SYSCFG_ANACR10;                                     // 0A8
    UInt32  m_SYSCFG_ANACR11;                                     // 0AC
    UInt32  m_SYSCFG_ANACR12;                                     // 0B0
    UInt32  m_SYSCFG_ANACR13;                                     // 0B4
    UInt32  m_SYSCFG_ANACR14;                                     // 0B8
    UInt32  m_SYSCFG_ANACR15;                                     // 0BC
    UInt32  m_SYSCFG_IRDROP_MON0;                                 // 0C0
    UInt32  m_SYSCFG_IRDROP_MON1;                                 // 0C4
    UInt32  m_SYSCFG_IRDROP_MON2;                                 // 0C8
    UInt32  m_SYSCFG_MDIO_WRITE;                                  // 0CC
    UInt32  m_SYSCFG_MDIO_READ;                                   // 0D0
    UInt32  m_RESERVED_0D4[1];                                  // 0D4
    UInt32  m_SYSCFG_PERIPH_AHB_CLK_GATE_MASK;                    // 0D8
    UInt32  m_SYSCFG_PERIPH_AHB_CLK_GATE_FORCE;                   // 0DC
    UInt32  m_SYSCFG_PERIPH_AHB_CLK_GATE_MONITOR_RAW;             // 0E0
    UInt32  m_SYSCFG_PERIPH_AHB_CLK_GATE_MONITOR;                 // 0E4
    UInt32  m_RESERVED_0E8[6];                                  // 0E8-100
    UInt32  m_SYSCFG_PERIPH_VIDEO_CODEC_AHB_CLK_EN;               // 100
    UInt32  m_SYSCFG_PERIPH_CAMARA_INTERFACE_AHB_CLK_EN;          // 104
    UInt32  m_SYSCFG_PERIPH_USB_AHB_CLK_EN;                       // 108
    UInt32  m_SYSCFG_PERIPH_GEA_AHB_CLK_EN;                       // 10C
    UInt32  m_SYSCFG_PERIPH_CRYPTO_AHB_CLK_EN;                    // 110
    UInt32  m_SYSCFG_PERIPH_PKA_AHB_CLK_EN;                       // 114
    UInt32  m_SYSCFG_PERIPH_UARTA_AHB_CLK_EN;                     // 118
    UInt32  m_SYSCFG_PERIPH_UARTB_AHB_CLK_EN;                     // 11C
    UInt32  m_SYSCFG_PERIPH_DA_AHB_CLK_EN;                        // 120
    UInt32  m_SYSCFG_PERIPH_MPCLK_AHB_CLK_EN;                     // 124
    UInt32  m_RESERVED_128[1];                                  // 128
    UInt32  m_SYSCFG_PERIPH_LCD_AHB_CLK_EN;                       // 12C
    UInt32  m_SYSCFG_PERIPH_DPE_AHB_CLK_EN;                       // 130
    UInt32  m_SYSCFG_PERIPH_DMAC_AHB_CLK_EN;                      // 134
    UInt32  m_SYSCFG_PERIPH_SDIO1_AHB_CLK_EN;                     // 138
    UInt32  m_SYSCFG_PERIPH_SDIO2_AHB_CLK_EN;                     // 13C
    UInt32  m_RESERVED_140[1];                                  // 140
    UInt32  m_SYSCFG_PERIPH_DES_AHB_CLK_EN;                       // 144
    UInt32  m_RESERVED_148[1];                                  // 148
    UInt32  m_SYSCFG_PERIPH_UARTC_AHB_CLK_EN;                     // 14C
    UInt32  m_SYSCFG_PERIPH_RNG_AHB_CLK_EN;                       // 150
    UInt32  m_SYSCFG_PERIPH_SDIO3_AHB_CLK_EN;                     // 154
    UInt32  m_SYSCFG_PERIPH_TVENC_AHB_CLK_EN;                     // 158
    UInt32  m_SYSCFG_PERIPH_FSUSBHOST_AHB_CLK_EN;                 // 15C
    UInt32  m_SYSCFG_PERIPH_MPHI_AHB_CLK_EN;                      // 160
    UInt32  m_RESERVED_164[3];                                  // 164-170
    UInt32  m_SYSCFG_TESTABILITY_ACCESS;                          // 170
    UInt32  m_SYSCFG_DISABLE_OTP_REGION_READ_ACCESS;              // 174
    UInt32  m_SYSCFG_DISABLE_OTP_REGION_WRITE_ACCESS;             // 178
    UInt32  m_SYSCFG_OTP_DEVICE_STATUS;                           // 17C
    UInt32  m_RESERVED_180[31];                                 // 180-1FC
    UInt32  m_SYSCFG_FPGA_Version;                                // 1FC
} BCMRDB_SYSCFG_REGS;

/****  SYSCFG  ****/
//#define SYSCFG_IOCR0                     (SYSCFG_BASE_ADDR + 0x0000)  /* IOCR0 bit I/O Configuration Register 0       */
  #define SYSCFG_IOCR0_FLASH_GPIO_MUX                0x80000000                    /* RW 0 FALE/FCLE, 1 GPIO[62:61],  */
  #define SYSCFG_IOCR0_FLASH_SD2_MUX                 0x40000000                    /* RW 0 FCLK,FADQ[8:0], 1 SD2,  */
  #define SYSCFG_IOCR0_LCD_CTRL_MUX                  0x20000000                    /* RW LCD/GPIO/MPHI, concatenated  */
  #define SYSCFG_IOCR0_LCDD1_LCDD15_MUX              0x10000000                    /* RW LCD/CAM/MPHI, concatenated w */
  #define SYSCFG_IOCR0_GPEN9_B1                      0x08000000                    /* RW {GPEN9_B1, GPEN9_B0}: GPEN9/ */
  #define SYSCFG_IOCR0_DSP_test_port_enable          0x04000000                    /* RW DSP/WCDMA muxout on LCD and  */
