/*
 * siw_touch_hal_watch.c - SiW touch hal driver for ABT
 *
 * Copyright (C) 2016 Silicon Works - http://www.siliconworks.co.kr
 * Copyright (C) 2018 Sony Mobile Communications Inc.
 * Author: Hyunho Kim <kimhh@siliconworks.co.kr>
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * version 2 as published by the Free Software Foundation.
 */

#include "siw_touch_cfg.h"

#if defined(__SIW_SUPPORT_WATCH)	//See siw_touch_cfg.h

#include <linux/kernel.h>
#include <linux/module.h>
#include <linux/atomic.h>
#include <linux/syscalls.h>
#include <linux/file.h>

#include "siw_touch.h"
#include "siw_touch_hal.h"
#include "siw_touch_bus.h"
#include "siw_touch_event.h"
#include "siw_touch_gpio.h"
#include "siw_touch_irq.h"
#include "siw_touch_sys.h"

#define __SUPPORT_WATCH_CTRL_ACCESS

#define __SUPPORT_WATCH_FONT_STS_CHK

/*
 * [Notice : __SUPPORT_WATCH_CTRL_ACCESS]
 * This chipset has watch function in its spec,
 * but its concept has been changed differently than before.
 * - The role for watch control including font download is mainly managed by MIPI.
 * - This watch layer supports 'config_fontdata'
 *   but this is just a kind of 'Plan B' for test or debugging
 *   when the MIPI control for font download doesn't work well.
 */
#if defined(CONFIG_TOUCHSCREEN_SIW_SW49408)
#undef	__SUPPORT_WATCH_CTRL_ACCESS
#undef	__SUPPORT_WATCH_FONT_STS_CHK
#endif

#define SIW_MAX_FONT_SIZE			(6<<10)

#define SIW_FONT_MAGIC_CODE			(0x3EEAFEEB)
#define SIW_FONT_MAGIC_CODE_SIZE	(4)

enum {
	EXT_WATCH_CFG_DEBUG = 'd',
};

enum {
	EXT_WATCH_LUT_NUM	= 7,
	EXT_WATCH_LUT_MAX	= 7,
};

enum {
	NOT_SUPPORT = 0,
	SUPPORT,
};

enum {
	UNBLOCKED = 0,
	BLOCKED,
};

enum {
	EXT_WATCH_OFF = 0,
	EXT_WATCH_ON,
};

enum {
	EXT_WATCH_RTC_START = 1,
	EXT_WATCH_RTC_STOP = 2,
};

enum {
	EXT_WATCH_SET_RTC_COUNT	= 305,
	EXT_WATCH_SET_RTC_ECNT	= 32764,
};

enum {
	FONT_MEM_CRC = (1<<8),
};

enum {
	FONT_EMPTY = 0,
	FONT_DOWNLOADING,
	FONT_READY,
};

enum {
	RTC_CLEAR = 0,
	RTC_RUN,
};

#define WATCH_TYPE(_watch)			((_watch->type) & 0xFFFF)
#define WATCH_TYPE_VAR(_watch)		(((_watch->type) >> 16) & 0xFF)

#define WATCH_FLAG(_watch)			(_watch->flag)

#define FONT_TYPE(_watch)			(_watch->font_type)

struct ext_watch_font_header {
	u32 magic_code;
	u8 width_num;
	u8 width_colon;
	u8 height;
	u8 font_id;
	u32 size;
};

__packed struct ext_watch_query_font_data {
	bool Font_supported;	/* 0:not supported, 1:supported */
	u8 max_font_x_size;		/* 1~9 number X max size. */
	u8 max_font_y_size;		/* 1~9 number Y max size. */
	u8 max_cln_x_size;		/* ":" X max size. (ex. 23:47) */
	u8 max_cln_y_size;		/* ":" Y max size. (ex. 23:47) */
};

struct ext_watch_query_font_position {	/* 0:not supported, 1:supported */
	bool vertical_position_supported;
	bool horizontal_position_supported;
};

struct ext_watch_query_font_time {	/* 0:not supported, 1:supported */
	bool h24_supported;
	bool ampm_supported;
};

__packed struct ext_watch_query_font_color {	/* 0:not supported, 1:supported */
	u8 max_num;		/* The number of LUT */
	bool lut_supported;
	bool alpha_supported;
	bool gradation_supported;
};

__packed struct ext_watch_query_font_effect {
	bool zero_supported;	/* 0:display off, 1:display on */
	u8 blink_type;			/* 0:blink disable, 1:500ms, 2:1sec, 3:2sec. */
};

struct ext_watch_config_font_effect_blink {
	u32	blink_type; /* 0:off, 1:125ms, 2:250ms, 3:500ms, 4:1s, 5:2sec. 6:4s, 7:8s */
	u32	bstartx; /* blink startx: watstartx <= bstartx <= bendx */
	u32	bendx; /* blink end: bendx <= watendx */
};

struct ext_watch_config_font_effect {
	u32	len;
	u32	watchon;				/* 0:watch off, 1:watch on */
	u32	h24_en;					/* 0:12 hour display, 1:24 hour display */
	u32	zero_disp;				/* 0:display off, 1:display on */
	u32	clock_disp_type;		/* 0:hour and min, 1:min and sec */
	u32	midnight_hour_zero_en;	/* 0: 12:00 mode, 1: 00:00 */
	struct ext_watch_config_font_effect_blink blink;	/*for blink effect */
};

struct ext_watch_config_font_lut {
	/* LUT */
	u32	rgb_blue;
	u32	rgb_green;
	u32	rgb_red;
};

struct ext_watch_config_font_prop {
	u32	len;
	u32	max_num;		/* The number of LUT */
	struct ext_watch_config_font_lut lut[EXT_WATCH_LUT_NUM];
};

struct ext_watch_config_font_pos {
	u32 len;
	u32	watstartx;
	u32	watendx;
	u32	watstarty;
	u32	watendy;
	/* relative position in watch area */
	u32	h1x_pos;	/* 1 ~ 9hour position */
	u32	h10x_pos;	/* 10, 20 hour position */
	u32	m1x_pos;	/* 1 ~ 9min position */
	u32	m10x_pos;	/* 10 ~ 50 min position */
	u32	clx_pos;	/* colon position */
};

struct ext_watch_config_time_sync {	/* to sync with AP's current time */
	u32	len;
	u32	rtc_cwhour;		/* for hour */
	u32	rtc_cwmin;		/* for min */
	u32	rtc_cwsec;		/* for sec */
	u32	rtc_cwmilli;	/* for millisecond */
};

__packed struct ext_watch_bits_ctrl {	/* 0x2D2 */
	u32	reserved0:1;
	u32	dispmode:1;	/* 0:U2, 1:AnyMode */
	u32	reserved1:5;
	u32	alpha:9;
};

__packed struct ext_watch_bits_area { 	/* 0x2D3, 0x2D4 */
	u32	watstart:12;
	u32	watend:12;
};

__packed struct ext_watch_bits_blink_area { /* 0x2D5 */
	u32 bstartx:12;
	u32 bendx:12;
};

__packed struct ext_watch_bits_lut {	/* 0x2D6 */
	u8 b;
	u8 g;
	u8 r;
	u8 rssvd0;
};

__packed struct ext_watch_bits_time {
	u32 hour:5;
	u32 min:6;
	u32 sec:6;
	u32 rsvd0:15;
};

__packed struct ext_watch_cfg_mode {	/* 36 bytes */
	struct ext_watch_bits_ctrl watch_ctrl;				/* 2 bytes */
	struct ext_watch_bits_area watch_area_x;			/* 3 bytes */
	struct ext_watch_bits_area watch_area_y;			/* 3 bytes */
	struct ext_watch_bits_blink_area blink_area;		/* 3 bytes */
	struct ext_watch_bits_lut __lut[EXT_WATCH_LUT_NUM];	/* 21 bytes */
	struct ext_watch_bits_lut *lut;
};

__packed struct ext_watch_cfg_time {	/* 36 bytes */
	u32 disp_waton;						/* 0xC10 watch display off:0, on:1*/
	struct ext_watch_bits_time rtc_sct;	/* 0x081 */
	u32 rtc_sctcnt;						/* 0x082 */
	u32 rtc_mit;						/* 0x083 */
	u32 rtc_capture;					/* 0x084 */
	struct ext_watch_bits_time rtc_ctst;	/* 0x087 */
	u32 rtc_ecnt;						/* 0x088 */
};

enum {
	POS_MAX_H10X	= (1<<9),
	POS_MAX_H1X		= (1<<9),
	POS_MAX_M10X	= (1<<9),
	POS_MAX_M1X		= (1<<9),
	POS_MAX_CLX		= (1<<9),
};

/* relative position in watch area */
__packed struct ext_watch_cfg_position {	/* 0xC11 */
	u32 h10x_pos:9;
	u32 h1x_pos:9;
	u32 reserved0:14;
	/* */
	u32 m10x_pos:9;
	u32 m1x_pos:9;
	u32 reserved1:14;
	/* */
	u32 clx_pos:9;
	u32 reserved2:23;
	/* */
	u32 zero_disp:1;
	u32 h24_en:1;
	u32 clock_disp_mode:1;
	u32 midnight_hour_zero_en:1;
	u32 reserved3:28;
	/* */
	u32 bhprd:3;
	u32 reserved4:29;
	/* */
	u32 num_width:8;
	u32 colon_width:8;
	u32 height:8;
	u32 font_id:8;
};

static inline int __check_pos_not_set(struct ext_watch_cfg_position *position)
{
	return !(position->m1x_pos);
}

__packed struct ext_watch_cfg_status {	/* 0x270*/
	u32 step:3;
	u32 en:1;
	u32 en_24:1;
	u32 zero_en:1;
	u32 disp_mode:1;
	u32 bhprd:3;
	u32 cur_hour:5;
	u32 cur_min:6;
	u32 cur_sec:6;
	u32 midnight_hour_zero_en:1;
	u32 reserved0:4;
};

